In [0]:
import numpy as np
from pandas import DataFrame

In [0]:
import pandas.util.testing as tm
tm.N = 3

def unpivot(frame):
  N,K = frame.shape
  data = {'value': frame.values.ravel('F'),
          'variable': np.asarray(frame.columns).repeat(N),
          'date': np.tile(np.asarray(frame.index), K)}
  return DataFrame(data, columns=['date','variable','value'])

dframe = unpivot(tm.makeTimeDataFrame())

In [3]:
dframe

         date variable     value
0  2000-01-03        A  1.789594
1  2000-01-04        A -0.798725
2  2000-01-05        A -1.652523
3  2000-01-03        B  0.853745
4  2000-01-04        B  0.028713
5  2000-01-05        B -0.646639
6  2000-01-03        C -0.810617
7  2000-01-04        C  0.679859
8  2000-01-05        C -0.756553
9  2000-01-03        D  0.131348
10 2000-01-04        D -0.452712
11 2000-01-05        D -0.570102

In [0]:
dframe_piv = dframe.pivot('date', 'variable', 'value') # 行はdate、列はvariable、値はvalueのピボットテーブルを作成する

In [5]:
dframe_piv

variable           A         B         C         D
date
2000-01-03  1.789594  0.853745 -0.810617  0.131348
2000-01-04 -0.798725  0.028713  0.679859 -0.452712
2000-01-05 -1.652523 -0.646639 -0.756553 -0.570102

In [6]:
dframe.pivot('variable', 'date', 'value')

date      2000-01-03  2000-01-04  2000-01-05
variable
A           1.789594   -0.798725   -1.652523
B           0.853745    0.028713   -0.646639
C          -0.810617    0.679859   -0.756553
D           0.131348   -0.452712   -0.570102

In [7]:
dframe.pivot('value', 'date', 'variable')

date      2000-01-03 2000-01-04 2000-01-05
value
-1.652523        NaN        NaN          A
-0.810617          C        NaN        NaN
-0.798725        NaN          A        NaN
-0.756553        NaN        NaN          C
-0.646639        NaN        NaN          B
-0.570102        NaN        NaN          D
-0.452712        NaN          D        NaN
 0.028713        NaN          B        NaN
 0.131348          D        NaN        NaN
 0.679859        NaN          C        NaN
 0.853745          B        NaN        NaN
 1.789594          A        NaN        NaN